micropython/micropython/ports/nxp/board/evkmimxrt1020/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSemcPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
// void BOARD_InitSemcPins(void) {
//   CLOCK_EnableClock(kCLOCK_Iomuxc);           /* iomuxc clock (iomuxc_clk_enable): 0x03u */

//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_00_SEMC_DATA00,         /* GPIO_EMC_00 is configured as SEMC_DATA00 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_01_SEMC_DATA01,         /* GPIO_EMC_01 is configured as SEMC_DATA01 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_02_SEMC_DATA02,         /* GPIO_EMC_02 is configured as SEMC_DATA02 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_03_SEMC_DATA03,         /* GPIO_EMC_03 is configured as SEMC_DATA03 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_04_SEMC_DATA04,         /* GPIO_EMC_04 is configured as SEMC_DATA04 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_05_SEMC_DATA05,         /* GPIO_EMC_05 is configured as SEMC_DATA05 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_06_SEMC_DATA06,         /* GPIO_EMC_06 is configured as SEMC_DATA06 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_07_SEMC_DATA07,         /* GPIO_EMC_07 is configured as SEMC_DATA07 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_08_SEMC_DM00,           /* GPIO_EMC_08 is configured as SEMC_DM00 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_09_SEMC_ADDR00,         /* GPIO_EMC_09 is configured as SEMC_ADDR00 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_10_SEMC_ADDR01,         /* GPIO_EMC_10 is configured as SEMC_ADDR01 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_11_SEMC_ADDR02,         /* GPIO_EMC_11 is configured as SEMC_ADDR02 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_12_SEMC_ADDR03,         /* GPIO_EMC_12 is configured as SEMC_ADDR03 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_13_SEMC_ADDR04,         /* GPIO_EMC_13 is configured as SEMC_ADDR04 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_14_SEMC_ADDR05,         /* GPIO_EMC_14 is configured as SEMC_ADDR05 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_15_SEMC_ADDR06,         /* GPIO_EMC_15 is configured as SEMC_ADDR06 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_16_SEMC_ADDR07,         /* GPIO_EMC_16 is configured as SEMC_ADDR07 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_17_SEMC_ADDR08,         /* GPIO_EMC_17 is configured as SEMC_ADDR08 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_18_SEMC_ADDR09,         /* GPIO_EMC_18 is configured as SEMC_ADDR09 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_19_SEMC_ADDR11,         /* GPIO_EMC_19 is configured as SEMC_ADDR11 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_20_SEMC_ADDR12,         /* GPIO_EMC_20 is configured as SEMC_ADDR12 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_21_SEMC_BA0,            /* GPIO_EMC_21 is configured as SEMC_BA0 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_22_SEMC_BA1,            /* GPIO_EMC_22 is configured as SEMC_BA1 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_23_SEMC_ADDR10,         /* GPIO_EMC_23 is configured as SEMC_ADDR10 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_24_SEMC_CAS,            /* GPIO_EMC_24 is configured as SEMC_CAS */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_25_SEMC_RAS,            /* GPIO_EMC_25 is configured as SEMC_RAS */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_26_SEMC_CLK,            /* GPIO_EMC_26 is configured as SEMC_CLK */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_27_SEMC_CKE,            /* GPIO_EMC_27 is configured as SEMC_CKE */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_28_SEMC_WE,             /* GPIO_EMC_28 is configured as SEMC_WE */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_29_SEMC_CS0,            /* GPIO_EMC_29 is configured as SEMC_CS0 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_30_SEMC_DATA08,         /* GPIO_EMC_30 is configured as SEMC_DATA08 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_31_SEMC_DATA09,         /* GPIO_EMC_31 is configured as SEMC_DATA09 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_32_SEMC_DATA10,         /* GPIO_EMC_32 is configured as SEMC_DATA10 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_33_SEMC_DATA11,         /* GPIO_EMC_33 is configured as SEMC_DATA11 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_34_SEMC_DATA12,         /* GPIO_EMC_34 is configured as SEMC_DATA12 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_35_SEMC_DATA13,         /* GPIO_EMC_35 is configured as SEMC_DATA13 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_36_SEMC_DATA14,         /* GPIO_EMC_36 is configured as SEMC_DATA14 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_37_SEMC_DATA15,         /* GPIO_EMC_37 is configured as SEMC_DATA15 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_EMC_38_SEMC_DM01,           /* GPIO_EMC_38 is configured as SEMC_DM01 */
//       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_00_SEMC_DATA00,         /* GPIO_EMC_00 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_01_SEMC_DATA01,         /* GPIO_EMC_01 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_02_SEMC_DATA02,         /* GPIO_EMC_02 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_03_SEMC_DATA03,         /* GPIO_EMC_03 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_04_SEMC_DATA04,         /* GPIO_EMC_04 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_05_SEMC_DATA05,         /* GPIO_EMC_05 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_06_SEMC_DATA06,         /* GPIO_EMC_06 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_07_SEMC_DATA07,         /* GPIO_EMC_07 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_08_SEMC_DM00,           /* GPIO_EMC_08 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_09_SEMC_ADDR00,         /* GPIO_EMC_09 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
