micropython/micropython/ports/nxp/board/evkmimxrt1020/pin_mux.c
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_10_SEMC_ADDR01,         /* GPIO_EMC_10 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_11_SEMC_ADDR02,         /* GPIO_EMC_11 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_12_SEMC_ADDR03,         /* GPIO_EMC_12 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_13_SEMC_ADDR04,         /* GPIO_EMC_13 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_14_SEMC_ADDR05,         /* GPIO_EMC_14 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_15_SEMC_ADDR06,         /* GPIO_EMC_15 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_16_SEMC_ADDR07,         /* GPIO_EMC_16 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_17_SEMC_ADDR08,         /* GPIO_EMC_17 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_18_SEMC_ADDR09,         /* GPIO_EMC_18 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_19_SEMC_ADDR11,         /* GPIO_EMC_19 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_20_SEMC_ADDR12,         /* GPIO_EMC_20 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_21_SEMC_BA0,            /* GPIO_EMC_21 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_22_SEMC_BA1,            /* GPIO_EMC_22 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_23_SEMC_ADDR10,         /* GPIO_EMC_23 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_24_SEMC_CAS,            /* GPIO_EMC_24 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_25_SEMC_RAS,            /* GPIO_EMC_25 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_26_SEMC_CLK,            /* GPIO_EMC_26 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_27_SEMC_CKE,            /* GPIO_EMC_27 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_28_SEMC_WE,             /* GPIO_EMC_28 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_29_SEMC_CS0,            /* GPIO_EMC_29 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_30_SEMC_DATA08,         /* GPIO_EMC_30 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
