micropython/micropython/ports/nxp/board/evkmimxrt1020/pin_mux.c
//       IOMUXC_GPIO_EMC_31_SEMC_DATA09,         /* GPIO_EMC_31 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_32_SEMC_DATA10,         /* GPIO_EMC_32 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_33_SEMC_DATA11,         /* GPIO_EMC_33 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_34_SEMC_DATA12,         /* GPIO_EMC_34 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_35_SEMC_DATA13,         /* GPIO_EMC_35 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_36_SEMC_DATA14,         /* GPIO_EMC_36 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_37_SEMC_DATA15,         /* GPIO_EMC_37 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_EMC_38_SEMC_DM01,           /* GPIO_EMC_38 PAD functional properties : */
//       0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Disabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 100K Ohm Pull Down
//                                                  Hyst. Enable Field: Hysteresis Disabled */
// }

